In [37]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [38]:
#create simple dataframe
df = pd.DataFrame({
    'color': ['red','blue','green','red','blue']
    
})

In [39]:
df.head()

   color
0    red
1   blue
2  green
3    red
4   blue

In [40]:
##create an instamce of oneHotencoder
encoder=OneHotEncoder()

In [41]:
##Perform fit and transform
encoded = encoder.fit_transform(df[['color']]).toarray()

In [42]:
import pandas as pd
encoder_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [43]:
encoder_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          0.0        1.0
4         1.0          0.0        0.0

In [44]:
##for new data
encoder.transform([['blue']]).toarray()

c:\Data Analyst Bootcamp\venv\Lib\site-packages\sklearn\utils\validation.py:2739: UserWarning: X does not have valid feature names, but OneHotEncoder was fitted with feature names
  warnings.warn(

array([[1., 0., 0.]])

In [45]:
pd.concat([df,encoder_df],axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3    red         0.0          0.0        1.0
4   blue         1.0          0.0        0.0

In [46]:
import seaborn as sns
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [47]:
## Label and Oridnal Encoding

In [48]:
df.head()

   color
0    red
1   blue
2  green
3    red
4   blue

In [49]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder = LabelEncoder()

In [50]:
lbl_encoder.fit_transform(df[['color']])

c:\Data Analyst Bootcamp\venv\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 2, 0])

In [51]:
lbl_encoder.transform([['red']])

c:\Data Analyst Bootcamp\venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [52]:
lbl_encoder.transform([['blue']])

c:\Data Analyst Bootcamp\venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([0])

In [53]:
##Ordinal Encoding
from sklearn.preprocessing import OrdinalEncoder

In [54]:
#create sample dataframe with ordinal variable
df = pd.DataFrame({
    'size': ['small','medium','large','medium','small','large']
})

In [55]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [56]:
# create an instanceof of OrdinalEncoder and then fit_transform
encoder = OrdinalEncoder(categories=[['small','medium','large']])

In [57]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [58]:
encoder.transform([['small']])

c:\Data Analyst Bootcamp\venv\Lib\site-packages\sklearn\utils\validation.py:2739: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

In [59]:
##Target Guided Ordinal Encoding

In [60]:
import pandas as pd
df = pd.DataFrame({
    'city':['New York','London','Paris','Tokyo','New York','Paris'],
    'price':[200,150,300,350,200,320]
})

In [61]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    350
4  New York    200
5     Paris    320

In [67]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [68]:
mean_price

{'London': 150.0, 'New York': 200.0, 'Paris': 310.0, 'Tokyo': 350.0}

In [69]:
df['city_encoded']=df['city'].map(mean_price)

In [70]:
df[['price','city_encoded']]

   price  city_encoded
0    200         200.0
1    150         150.0
2    300         310.0
3    350         350.0
4    200         200.0
5    320         310.0